In [11]:
import pandas as pd
import os

In [166]:
import warnings
warnings.filterwarnings('ignore')

In [141]:
t=pd.read_csv(r"C:\Users\jyc68\LG_DX_school_code\data\train.csv",encoding="euc-kr",index_col="PassengerId")
t[t['Embarked']=='S']

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [35]:
t.shape

(891, 11)

In [36]:
t.info

<bound method DataFrame.info of              Survived  Pclass  \
PassengerId
1                   0       3
2                   1       1
3                   1       3
4                   1       1
5                   0       3
...               ...     ...
887                 0       2
888                 1       1
889                 0       3
890                 1       1
891                 0       3

                                                          Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
...                                                        ...     ...   ...
887                                      Montvila, Rev. Juozas    male  27.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN
890                                      Behr, Mr. Karl Howell    male  26.0
891                                        Dooley, Mr. Patrick    male  32.0

             SibSp  Parch            Ticket     Fare Cabin Embarked
PassengerId
1                1      0         A/5 21171   7.2500   NaN        S
2                1      0          PC 17599  71.2833   C85        C
3                0      0  STON/O2. 3101282   7.9250   NaN        S
4                1      0            113803  53.1000  C123        S
5                0      0            373450   8.0500   NaN        S
...            ...    ...               ...      ...   ...      ...
887              0      0            211536  13.0000   NaN        S
888              0      0            112053  30.0000   B42        S
889              1      2        W./C. 6607  23.4500   NaN        S
890              0      0            111369  30.0000  C148        C
891              0      0            370376   7.7500   NaN        Q

[891 rows x 11 columns]>

In [37]:
t[t['Age'].isnull()]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [38]:
t[t['Survived']==1]['Sex'].value_counts('M')*100

Sex
female    68.128655
male      31.871345
Name: proportion, dtype: float64

## 3.전처리 응용 실습
3-1 AGE 결측치를 전체의 평균 으로 채우기

In [63]:
a=t['Age'].notnull()
c=t['Age'].isnull()

In [67]:
tmp=t[a]['Age'].mean().astpye(int)
tmp

np.float64(30.0)

In [68]:
t['Age']df.fillna(특정값)

In [69]:
t

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.0,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [74]:
male_mean=t[t['Sex']=='male']['Age'].mean().astype(int)

In [77]:
male_mean

np.int64(30)

In [75]:
female_mean=t[t['Sex']=='female']['Age'].mean().astype(int)

In [76]:
female_mean

np.int64(27)

In [79]:
t.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [80]:
t.groupby('Sex')['Age'].transform('median')# 전부다 채워버리는 문제

PassengerId
1      29.0
2      27.0
3      27.0
4      27.0
5      29.0
       ...
887    29.0
888    27.0
889    27.0
890    29.0
891    29.0
Name: Age, Length: 891, dtype: float64

In [146]:
t['Age']=t['Age'].fillna(t.groupby('Sex')['Age'].transform('median'))

In [135]:
t['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [144]:
t['Embarked'].value_counts().index[0]

'S'

In [167]:
a=sorted(t['Embarked'].unique())
print(a[len(a)-1])

S

In [168]:
t['Embarked']=t['Embarked'].fillna(t['Embarked'].value_counts().index[0])

In [169]:
t[t['Embarked']== 'S']

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...
884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,27.0,1,2,W./C. 6607,23.4500,NaN,S

In [170]:
t

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,27.0,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [171]:
t['Age'].isnull().sum()

np.int64(0)

In [172]:
t['Embarked'].isnull().sum()

np.int64(0)

In [179]:
t[t['Sex']=='male']['Survived'].value_counts(1)*100

Survived
0    81.109185
1    18.890815
Name: proportion, dtype: float64

In [181]:
survived=(t[t['Sex']=='male']['Survived'].value_counts(1)*100).round(2)
print(f'남자에서 비율은 사망 : {survived[0]} %       생존 : {survived[1]}%')

남자에서 비율은 사망 : 81.11 %       생존 : 18.89%

In [182]:
survived=(t[t['Sex']=='female']['Survived'].value_counts(1)*100).round(2)
print(f'여자에서 비율은 사망 : {survived[0]} %       생존 : {survived[1]}%')

여자에서 비율은 사망 : 25.8 %       생존 : 74.2%

In [207]:
bins=[-1,9,19,29,39,49,59,69,79,89]
labels=['0대','10대','20대','30대','40대','50대','60대','70대','80대']
tmp=pd.cut(t['Age'],bins,labels=labels)

In [208]:
del t['CATS']
t.insert(loc =5,column= 'CATS',value =tmp)

In [215]:
t['CATS'].value_counts(sort=False)

CATS
0대      62
10대    102
20대    397
30대    167
40대     89
50대     48
60대     19
70대      6
80대      1
Name: count, dtype: int64

In [216]:
agez=(t.groupby('CATS')['Survived'].value_counts(1)*100).round(2)
agez.shape

(18,)

In [213]:
print(agez)

CATS  Survived
0대    1            61.29
      0            38.71
10대   0            59.80
      1            40.20
20대   0            67.51
      1            32.49
30대   0            56.29
      1            43.71
40대   0            61.80
      1            38.20
50대   0            58.33
      1            41.67
60대   0            68.42
      1            31.58
70대   0           100.00
      1             0.00
80대   1           100.00
      0             0.00
Name: proportion, dtype: float64

In [212]:
t['Age'].min()

0.42

In [217]:
    # 1. 표 형태로 펼치기
    # fillna(0)은 데이터가 없는 경우(예: 80대 사망자 0명)를 0으로 채워줍니다.
    agez_pretty = agez.unstack().fillna(0)
    
    # 2. 컬럼명 읽기 쉽게 변경 (0: 사망, 1: 생존)
    agez_pretty.columns = ['사망 (%)', '생존 (%)']
    
    # 3. 출력
    print("■ 연령대별 생존/사망 비율 요약")
    display(agez_pretty)

■ 연령대별 생존/사망 비율 요약

      사망 (%)  생존 (%)
CATS
0대     38.71   61.29
10대    59.80   40.20
20대    67.51   32.49
30대    56.29   43.71
40대    61.80   38.20
50대    58.33   41.67
60대    68.42   31.58
70대   100.00    0.00
80대     0.00  100.00